"""
 	(№ 4947 Д. Поляков) Особыми будем называть нетривиальные делители числа, все цифры 
    которых нечётные. Нетривиальными считаются все делители, кроме 1 и самого числа. 
    Пусть D(N) – пятый по величине (считая с наибольшего) особый делитель натурального 
    числа N. Если у числа N меньше пяти различных особых делителей, то принимаем D(N) = 0. 
    Найдите 5 наибольших натуральных чисел, меньших 300 000 000, для которых D(N) > 0. 
    В ответе запишите для каждого найденного N сначала значение D(N), а затем общее количество 
    особых делителей (в порядке возрастания соответствующих чисел N). 
"""

# TODO: Напишите свой код ниже

