"""
В файле содержится последовательность целых чисел. Элементы последовательности могут 
принимать целые значения от -100 000 до 100 000 включительно. Определите количество 
пар последовательности, в которых модуль разности элементов пары не меньше максимального 
элемента последовательности, являющегося четырёхзначным числом.

В ответе запишите количество найденных пар чисел, затем максимальную из сумм элементов таких пар.
В данной задаче под парой подразумевается два идущих подряд элемента последовательности.
"""

# TODO: Напишите свой код ниже

