"""
Используя f-строки напишите программу, которая получает данные: имя пользователя,
возраст пользователя; и выводит отформатированные данные.

ПРИМЕР
Input:
    Виктор
    40
Output:
    Вас зовут Виктор. Ваш возраст: 40!
"""

# TODO: Напишите свой код ниже
name = input()
age = input()
print(f"Вас зовут {name}. Ваш возраст: {age}!")