"""
В файле содержится последовательность натуральных чисел. Её элементы могут принимать целые 
значения от 1 до 100 000 включительно. Определите количество троек последовательности, 
в которых хотя бы один элемент кратен наименьшему числу последовательности, кратному 2025, 
а сумма тройки при этом — шестизначное число.

В ответе запишите количество найденных троек, затем максимальную из сумм элементов таких троек.
В этой задаче под тройкой подразумеваются три идущих подряд элемента последовательности.
"""

# TODO: Напишите свой код ниже
