"""
Напишите программу для решения следующей задачи. Камера наблюдения 
регистрирует в автоматическом режиме скорость проезжающих мимо нее 
автомобилей, округляя значения скорости до целых чисел. Необходимо 
определить минимальную зарегистрированную скорость автомобиля. Если 
скорость хотя бы одного автомобиля была больше 80 км/ч, выведите 
«YES», иначе выведите «NO».

Программа получает на вход число проехавших автомобилей N (1 ≤ N ≤ 30), 
затем указываются их скорости. Значение скорости не может быть меньше 1 
и больше 300.Программа должна сначала вывести минимальную скорость, затем YES или NO. 
Пример работы программы:
Входные данные:
4
74
69
63
96
Выходные данные: 
63
YES
"""

# TODO: Напишите свой код ниже
