"""
Произведение 3-х
На вход программе подается 3 целых числа, каждое в отдельной строке.
Напишите программу, которая вычисляет произведение этих чисел.

Формат входных данных
На вход программе подаётся 3 целых числа

Формат выходных данных
Программа должна вывести произведение этих чисел

Пример:

Input: 
    3
    2
    10
Output: 
    60

Примечание: используйте функцию int() которая конвертирует строку в целое число
"""

# TODO: Напишите свой код ниже
a = int(input())
b = int(input())
c = int(input())
print(a * b * c)