
"""
Вводится строка my_string. Требуется составить словарь в котором ключами будут
символы этой строки, а значениями - количество вхождений символа в строку. Заглавная и строчная
буквы считаются одинаковыми и в словарь входит строчная.
Примечание:
    Метод А.lower() заменяет в строке А большие заглавные на строчные.
Пример:
Input:
    Звезды светят ярко!
Output:
    {'з': 2, 'в': 2, 'е': 2, 'д': 1, 'ы': 1, ' ': 2, 'с': 1, 'т': 2, 'я': 2, 'р': 1, 'к': 1, 'о': 1, '!': 1}
"""

# TODO: Напишите свой код ниже
